#define 中文库 "chineseCPP.h"
#include 中文库

#include 输入输出流库
#include 字符串库
#include C时间库
#include C标准库

使用标准名字空间;

字符串返回 获取我的地址函数();//header

字符串返回 获取我的地址函数(){//body    
    返回 (字符串返回)"广州市天河区";
}

空 我的函数(整数 参数1);//header

空 我的函数(整数 参数1){//body
    屏幕输出<<"中文函数";换行;
}



整数 主函数(){
    屏幕输出 << "中文c++!";换行;

    整数 数字1;

    // 输入整数(数字1);
    // 输出整数(数字1);
    
    循环正序次数i(10)
    {
        屏幕输出<<当前次数i<<空格;
    }
    换行;

    屏幕输出<<获取我的地址函数();换行;

    //产生随机数
    随机数初始化函数((正数) 时间函数(无效));
    整数 随机数 = 随机数函数();

    屏幕输出<<随机数;换行;
    屏幕输出<<随机数函数();换行;
    屏幕输出<<随机数函数();换行;
    屏幕输出<<随机数函数();换行;
    屏幕输出<<随机数函数();换行;
    屏幕输出<<随机数函数();换行;
    屏幕输出<<随机数函数();换行;
    屏幕输出<<随机数函数();换行;

    返回 0;
}